Merge pull request #4 from Julian0444/feat/ToDeploy
feat: release QueryTrace portfolio version
